Pugnator/CoreTex/CoreTex/include/core/stm32f10x.hpp
/**
 ******************************************************************************
 * @file    stm32f10x.h
 * @author  MCD Application Team
 * @version V3.5.0
 * @date    11-March-2011
 * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Header File.
 *          This file contains all the peripheral register's definitions, bits
 *          definitions and memory mapping for STM32F10x Connectivity line,
 *          High density, High density value line, Medium density,
 *          Medium density Value line, Low density, Low density Value line
 *          and XL-density devices.
 *
 *          The file is the unique include file that the application programmer
 *          is using in the C source code, usually in main.c. This file contains:
 *           - Configuration section that allows to select:
 *              - The device used in the target application
 *              - To use or not the peripheral’s drivers in application code(i.e.
 *                code will be based on direct access to peripheral’s registers
 *                rather than drivers API), this option is controlled by
 *                "#define USE_STDPERIPH_DRIVER"
 *              - To change few application-specific parameters such as the HSE
 *                crystal frequency
 *           - Data structures and the address mapping for all peripherals
 *           - Peripheral's registers declarations and bits definition
 *           - Macros to access peripheral’s registers hardware
 *
 ******************************************************************************
 * @attention
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
 ******************************************************************************
 */

/** @addtogroup CMSIS
 * @{
 */

/** @addtogroup stm32f10x
 * @{
 */

#ifndef __STM32F10x_H
#define __STM32F10x_H

#ifdef __cplusplus
extern "C"
{
#endif

  /** @addtogroup Library_configuration_section
   * @{
   */

  /* Uncomment the line below according to the target STM32 device used in your
   application
   */

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD) && !defined (STM32F10X_HD_VL) && !defined (STM32F10X_XL) && !defined (STM32F10X_CL)
  /* #define STM32F10X_LD *//*!< STM32F10X_LD: STM32 Low density devices */
  /* #define STM32F10X_LD_VL *//*!< STM32F10X_LD_VL: STM32 Low density Value Line devices */
  /* #define STM32F10X_MD *//*!< STM32F10X_MD: STM32 Medium density devices */
  /* #define STM32F10X_MD_VL *//*!< STM32F10X_MD_VL: STM32 Medium density Value Line devices */
  /* #define STM32F10X_HD *//*!< STM32F10X_HD: STM32 High density devices */
  /* #define STM32F10X_HD_VL *//*!< STM32F10X_HD_VL: STM32 High density value line devices */
  /* #define STM32F10X_XL *//*!< STM32F10X_XL: STM32 XL-density devices */
  /* #define STM32F10X_CL *//*!< STM32F10X_CL: STM32 Connectivity line devices */
#endif
  /*  Tip: To avoid modifying this file each time you need to switch between these
   devices, you can define the device in your toolchain compiler preprocessor.

   - Low-density devices are STM32F101xx, STM32F102xx and STM32F103xx microcontrollers
   where the Flash memory density ranges between 16 and 32 Kbytes.
   - Low-density value line devices are STM32F100xx microcontrollers where the Flash
   memory density ranges between 16 and 32 Kbytes.
   - Medium-density devices are STM32F101xx, STM32F102xx and STM32F103xx microcontrollers
   where the Flash memory density ranges between 64 and 128 Kbytes.
   - Medium-density value line devices are STM32F100xx microcontrollers where the
   Flash memory density ranges between 64 and 128 Kbytes.
   - High-density devices are STM32F101xx and STM32F103xx microcontrollers where
   the Flash memory density ranges between 256 and 512 Kbytes.
   - High-density value line devices are STM32F100xx microcontrollers where the
   Flash memory density ranges between 256 and 512 Kbytes.
   - XL-density devices are STM32F101xx and STM32F103xx microcontrollers where
   the Flash memory density ranges between 512 and 1024 Kbytes.
   - Connectivity line devices are STM32F105xx and STM32F107xx microcontrollers.
   */

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD) && !defined (STM32F10X_HD_VL) && !defined (STM32F10X_XL) && !defined (STM32F10X_CL)
#error "Please select first the target STM32F10x device used in your application (in stm32f10x.h file)"
#endif

#if !defined  USE_STDPERIPH_DRIVER
  /**
   * @brief Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will
   be based on direct access to peripherals registers
   */
  /*#define USE_STDPERIPH_DRIVER*/
#endif

  /**
   * @brief In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
   can define the HSE value in your toolchain compiler preprocessor.
   */
#if !defined  HSE_VALUE
#ifdef STM32F10X_CL
#define HSE_VALUE    ((uint32_t)25000000) /*!< Value of the External oscillator in Hz */
#else
#define HSE_VALUE    ((uint32_t)8000000) /*!< Value of the External oscillator in Hz */
#endif /* STM32F10X_CL */
#endif /* HSE_VALUE */

  /**
   * @brief In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value
   */
#define HSE_STARTUP_TIMEOUT   ((uint16_t)0x0500) /*!< Time out for HSE start up */

#define HSI_VALUE    ((uint32_t)8000000) /*!< Value of the Internal oscillator in Hz*/

  /**
   * @brief STM32F10x Standard Peripheral Library version number
   */
#define __STM32F10X_STDPERIPH_VERSION_MAIN   (0x03) /*!< [31:24] main version */
#define __STM32F10X_STDPERIPH_VERSION_SUB1   (0x05) /*!< [23:16] sub1 version */
#define __STM32F10X_STDPERIPH_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define __STM32F10X_STDPERIPH_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define __STM32F10X_STDPERIPH_VERSION       ( (__STM32F10X_STDPERIPH_VERSION_MAIN << 24)\
                                             |(__STM32F10X_STDPERIPH_VERSION_SUB1 << 16)\
                                             |(__STM32F10X_STDPERIPH_VERSION_SUB2 << 8)\
                                             |(__STM32F10X_STDPERIPH_VERSION_RC))

  /**
   * @}
   */

  /** @addtogroup Configuration_section_for_CMSIS
   * @{
   */

  /**
   * @brief Configuration of the Cortex-M3 Processor and Core Peripherals
   */
#ifdef STM32F10X_XL
#define __MPU_PRESENT             1 /*!< STM32 XL-density devices provide an MPU */
#else
#define __MPU_PRESENT             0 /*!< Other STM32 devices does not provide an MPU */
#endif /* STM32F10X_XL */
#define __NVIC_PRIO_BITS          4 /*!< STM32 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used */

  /**
   * @brief STM32F10x Interrupt Number Definition, according to the selected device
   *        in @ref Library_configuration_section
   */
  typedef enum IRQn
  {
    /******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn = -14, /*!< 2 Non Maskable Interrupt                             */
    MemoryManagement_IRQn = -12, /*!< 4 Cortex-M3 Memory Management Interrupt              */
    BusFault_IRQn = -11, /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
    UsageFault_IRQn = -10, /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
    SVCall_IRQn = -5, /*!< 11 Cortex-M3 SV Call Interrupt                       */
    DebugMonitor_IRQn = -4, /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
    PendSV_IRQn = -2, /*!< 14 Cortex-M3 Pend SV Interrupt                       */
    SysTick_IRQn = -1, /*!< 15 Cortex-M3 System Tick Interrupt                   */

    /******  STM32 specific Interrupt Numbers *********************************************************/
    WWDG_IRQn = 0, /*!< Window WatchDog Interrupt                            */
    PVD_IRQn = 1, /*!< PVD through EXTI Line detection Interrupt            */
    TAMPER_IRQn = 2, /*!< Tamper Interrupt                                     */
    RTC_IRQn = 3, /*!< RTC global Interrupt                                 */
    FLASH_IRQn = 4, /*!< FLASH global Interrupt                               */
    RCC_IRQn = 5, /*!< RCC global Interrupt                                 */
    EXTI0_IRQn = 6, /*!< EXTI Line0 Interrupt                                 */
    EXTI1_IRQn = 7, /*!< EXTI Line1 Interrupt                                 */
    EXTI2_IRQn = 8, /*!< EXTI Line2 Interrupt                                 */
    EXTI3_IRQn = 9, /*!< EXTI Line3 Interrupt                                 */
    EXTI4_IRQn = 10, /*!< EXTI Line4 Interrupt                                 */
    DMA1_Channel1_IRQn = 11, /*!< DMA1 Channel 1 global Interrupt                      */
    DMA1_Channel2_IRQn = 12, /*!< DMA1 Channel 2 global Interrupt                      */
    DMA1_Channel3_IRQn = 13, /*!< DMA1 Channel 3 global Interrupt                      */
    DMA1_Channel4_IRQn = 14, /*!< DMA1 Channel 4 global Interrupt                      */
    DMA1_Channel5_IRQn = 15, /*!< DMA1 Channel 5 global Interrupt                      */
    DMA1_Channel6_IRQn = 16, /*!< DMA1 Channel 6 global Interrupt                      */
    DMA1_Channel7_IRQn = 17, /*!< DMA1 Channel 7 global Interrupt                      */

#ifdef STM32F10X_LD
  ADC1_2_IRQn = 18, /*!< ADC1 and ADC2 global Interrupt                       */
  USB_HP_CAN1_TX_IRQn = 19, /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USB_LP_CAN1_RX0_IRQn = 20, /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn = 21, /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn = 22, /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_IRQn = 24, /*!< TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn = 25, /*!< TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn = 26, /*!< TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  USBWakeUp_IRQn = 42 /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
#endif /* STM32F10X_LD */

#ifdef STM32F10X_LD_VL
  ADC1_IRQn = 18, /*!< ADC1 global Interrupt                                */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_TIM15_IRQn = 24, /*!< TIM1 Break and TIM15 Interrupts                      */
  TIM1_UP_TIM16_IRQn = 25, /*!< TIM1 Update and TIM16 Interrupts                     */
  TIM1_TRG_COM_TIM17_IRQn = 26, /*!< TIM1 Trigger and Commutation and TIM17 Interrupt     */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  CEC_IRQn = 42, /*!< HDMI-CEC Interrupt                                   */
  TIM6_DAC_IRQn = 54, /*!< TIM6 and DAC underrun Interrupt                      */
  TIM7_IRQn = 55 /*!< TIM7 Interrupt                                       */
#endif /* STM32F10X_LD_VL */

#ifdef STM32F10X_MD
  ADC1_2_IRQn = 18, /*!< ADC1 and ADC2 global Interrupt                       */
  USB_HP_CAN1_TX_IRQn = 19, /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USB_LP_CAN1_RX0_IRQn = 20, /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn = 21, /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn = 22, /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_IRQn = 24, /*!< TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn = 25, /*!< TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn = 26, /*!< TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  TIM4_IRQn = 30, /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn = 33, /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn = 34, /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  SPI2_IRQn = 36, /*!< SPI2 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  USART3_IRQn = 39, /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  USBWakeUp_IRQn = 42 /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
#endif /* STM32F10X_MD */

#ifdef STM32F10X_MD_VL
  ADC1_IRQn = 18, /*!< ADC1 global Interrupt                                */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_TIM15_IRQn = 24, /*!< TIM1 Break and TIM15 Interrupts                      */
  TIM1_UP_TIM16_IRQn = 25, /*!< TIM1 Update and TIM16 Interrupts                     */
  TIM1_TRG_COM_TIM17_IRQn = 26, /*!< TIM1 Trigger and Commutation and TIM17 Interrupt     */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  TIM4_IRQn = 30, /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn = 33, /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn = 34, /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  SPI2_IRQn = 36, /*!< SPI2 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  USART3_IRQn = 39, /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  CEC_IRQn = 42, /*!< HDMI-CEC Interrupt                                   */
  TIM6_DAC_IRQn = 54, /*!< TIM6 and DAC underrun Interrupt                      */
  TIM7_IRQn = 55 /*!< TIM7 Interrupt                                       */
#endif /* STM32F10X_MD_VL */

#ifdef STM32F10X_HD
  ADC1_2_IRQn = 18, /*!< ADC1 and ADC2 global Interrupt                       */
  USB_HP_CAN1_TX_IRQn = 19, /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USB_LP_CAN1_RX0_IRQn = 20, /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn = 21, /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn = 22, /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_IRQn = 24, /*!< TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn = 25, /*!< TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn = 26, /*!< TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  TIM4_IRQn = 30, /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn = 33, /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn = 34, /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  SPI2_IRQn = 36, /*!< SPI2 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  USART3_IRQn = 39, /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  USBWakeUp_IRQn = 42, /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
  TIM8_BRK_IRQn = 43, /*!< TIM8 Break Interrupt                                 */
  TIM8_UP_IRQn = 44, /*!< TIM8 Update Interrupt                                */
  TIM8_TRG_COM_IRQn = 45, /*!< TIM8 Trigger and Commutation Interrupt               */
  TIM8_CC_IRQn = 46, /*!< TIM8 Capture Compare Interrupt                       */
  ADC3_IRQn = 47, /*!< ADC3 global Interrupt                                */
  FSMC_IRQn = 48, /*!< FSMC global Interrupt                                */
  SDIO_IRQn = 49, /*!< SDIO global Interrupt                                */
  TIM5_IRQn = 50, /*!< TIM5 global Interrupt                                */
  SPI3_IRQn = 51, /*!< SPI3 global Interrupt                                */
  UART4_IRQn = 52, /*!< UART4 global Interrupt                               */
  UART5_IRQn = 53, /*!< UART5 global Interrupt                               */
  TIM6_IRQn = 54, /*!< TIM6 global Interrupt                                */
  TIM7_IRQn = 55, /*!< TIM7 global Interrupt                                */
  DMA2_Channel1_IRQn = 56, /*!< DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn = 57, /*!< DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn = 58, /*!< DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_5_IRQn = 59 /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
#endif /* STM32F10X_HD */

#ifdef STM32F10X_HD_VL
  ADC1_IRQn = 18, /*!< ADC1 global Interrupt                                */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_TIM15_IRQn = 24, /*!< TIM1 Break and TIM15 Interrupts                      */
  TIM1_UP_TIM16_IRQn = 25, /*!< TIM1 Update and TIM16 Interrupts                     */
  TIM1_TRG_COM_TIM17_IRQn = 26, /*!< TIM1 Trigger and Commutation and TIM17 Interrupt     */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  TIM4_IRQn = 30, /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn = 33, /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn = 34, /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  SPI2_IRQn = 36, /*!< SPI2 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  USART3_IRQn = 39, /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  CEC_IRQn = 42, /*!< HDMI-CEC Interrupt                                   */
  TIM12_IRQn = 43, /*!< TIM12 global Interrupt                               */
  TIM13_IRQn = 44, /*!< TIM13 global Interrupt                               */
  TIM14_IRQn = 45, /*!< TIM14 global Interrupt                               */
  TIM5_IRQn = 50, /*!< TIM5 global Interrupt                                */
  SPI3_IRQn = 51, /*!< SPI3 global Interrupt                                */
  UART4_IRQn = 52, /*!< UART4 global Interrupt                               */
  UART5_IRQn = 53, /*!< UART5 global Interrupt                               */
  TIM6_DAC_IRQn = 54, /*!< TIM6 and DAC underrun Interrupt                      */
  TIM7_IRQn = 55, /*!< TIM7 Interrupt                                       */
  DMA2_Channel1_IRQn = 56, /*!< DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn = 57, /*!< DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn = 58, /*!< DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_5_IRQn = 59, /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
  DMA2_Channel5_IRQn = 60 /*!< DMA2 Channel 5 global Interrupt (DMA2 Channel 5 is
   mapped at position 60 only if the MISC_REMAP bit in
   the AFIO_MAPR2 register is set)                      */
#endif /* STM32F10X_HD_VL */

