Pugnator/CoreTex/CoreTex/include/core/stm32f10x.hpp
#ifdef STM32F10X_XL
  ADC1_2_IRQn = 18, /*!< ADC1 and ADC2 global Interrupt                       */
  USB_HP_CAN1_TX_IRQn = 19, /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USB_LP_CAN1_RX0_IRQn = 20, /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn = 21, /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn = 22, /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_TIM9_IRQn = 24, /*!< TIM1 Break Interrupt and TIM9 global Interrupt       */
  TIM1_UP_TIM10_IRQn = 25, /*!< TIM1 Update Interrupt and TIM10 global Interrupt     */
  TIM1_TRG_COM_TIM11_IRQn = 26, /*!< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  TIM4_IRQn = 30, /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn = 33, /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn = 34, /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  SPI2_IRQn = 36, /*!< SPI2 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  USART3_IRQn = 39, /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  USBWakeUp_IRQn = 42, /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
  TIM8_BRK_TIM12_IRQn = 43, /*!< TIM8 Break Interrupt and TIM12 global Interrupt      */
  TIM8_UP_TIM13_IRQn = 44, /*!< TIM8 Update Interrupt and TIM13 global Interrupt     */
  TIM8_TRG_COM_TIM14_IRQn = 45, /*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
  TIM8_CC_IRQn = 46, /*!< TIM8 Capture Compare Interrupt                       */
  ADC3_IRQn = 47, /*!< ADC3 global Interrupt                                */
  FSMC_IRQn = 48, /*!< FSMC global Interrupt                                */
  SDIO_IRQn = 49, /*!< SDIO global Interrupt                                */
  TIM5_IRQn = 50, /*!< TIM5 global Interrupt                                */
  SPI3_IRQn = 51, /*!< SPI3 global Interrupt                                */
  UART4_IRQn = 52, /*!< UART4 global Interrupt                               */
  UART5_IRQn = 53, /*!< UART5 global Interrupt                               */
  TIM6_IRQn = 54, /*!< TIM6 global Interrupt                                */
  TIM7_IRQn = 55, /*!< TIM7 global Interrupt                                */
  DMA2_Channel1_IRQn = 56, /*!< DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn = 57, /*!< DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn = 58, /*!< DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_5_IRQn = 59 /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
#endif /* STM32F10X_XL */

#ifdef STM32F10X_CL
  ADC1_2_IRQn = 18, /*!< ADC1 and ADC2 global Interrupt                       */
  CAN1_TX_IRQn = 19, /*!< USB Device High Priority or CAN1 TX Interrupts       */
  CAN1_RX0_IRQn = 20, /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn = 21, /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn = 22, /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn = 23, /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_IRQn = 24, /*!< TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn = 25, /*!< TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn = 26, /*!< TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn = 27, /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn = 28, /*!< TIM2 global Interrupt                                */
  TIM3_IRQn = 29, /*!< TIM3 global Interrupt                                */
  TIM4_IRQn = 30, /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn = 31, /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn = 32, /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn = 33, /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn = 34, /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn = 35, /*!< SPI1 global Interrupt                                */
  SPI2_IRQn = 36, /*!< SPI2 global Interrupt                                */
  USART1_IRQn = 37, /*!< USART1 global Interrupt                              */
  USART2_IRQn = 38, /*!< USART2 global Interrupt                              */
  USART3_IRQn = 39, /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn = 40, /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn = 41, /*!< RTC Alarm through EXTI Line Interrupt                */
  OTG_FS_WKUP_IRQn = 42, /*!< USB OTG FS WakeUp from suspend through EXTI Line Interrupt */
  TIM5_IRQn = 50, /*!< TIM5 global Interrupt                                */
  SPI3_IRQn = 51, /*!< SPI3 global Interrupt                                */
  UART4_IRQn = 52, /*!< UART4 global Interrupt                               */
  UART5_IRQn = 53, /*!< UART5 global Interrupt                               */
  TIM6_IRQn = 54, /*!< TIM6 global Interrupt                                */
  TIM7_IRQn = 55, /*!< TIM7 global Interrupt                                */
  DMA2_Channel1_IRQn = 56, /*!< DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn = 57, /*!< DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn = 58, /*!< DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_IRQn = 59, /*!< DMA2 Channel 4 global Interrupt                      */
  DMA2_Channel5_IRQn = 60, /*!< DMA2 Channel 5 global Interrupt                      */
  ETH_IRQn = 61, /*!< Ethernet global Interrupt                            */
  ETH_WKUP_IRQn = 62, /*!< Ethernet Wakeup through EXTI line Interrupt          */
  CAN2_TX_IRQn = 63, /*!< CAN2 TX Interrupt                                    */
  CAN2_RX0_IRQn = 64, /*!< CAN2 RX0 Interrupt                                   */
  CAN2_RX1_IRQn = 65, /*!< CAN2 RX1 Interrupt                                   */
  CAN2_SCE_IRQn = 66, /*!< CAN2 SCE Interrupt                                   */
  OTG_FS_IRQn = 67 /*!< USB OTG FS global Interrupt                          */
#endif /* STM32F10X_CL */
} IRQn_Type;

/**
 * @}
 */

#include <core/core_cm3.hpp>
#include <stdint.h>

