Pugnator/CoreTex/CoreTex/include/core/stm32f10x.hpp
/** @addtogroup Exported_types
 * @{
 */

/*!< STM32F10x Standard Peripheral Library old types (maintained for legacy purpose) */
typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32; /*!< Read Only */
typedef const int16_t sc16; /*!< Read Only */
typedef const int8_t sc8; /*!< Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

typedef __I int32_t vsc32; /*!< Read Only */
typedef __I int16_t vsc16; /*!< Read Only */
typedef __I int8_t vsc8; /*!< Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t u8;

typedef const uint32_t uc32; /*!< Read Only */
typedef const uint16_t uc16; /*!< Read Only */
typedef const uint8_t uc8; /*!< Read Only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t vu8;

typedef __I uint32_t vuc32; /*!< Read Only */
typedef __I uint16_t vuc16; /*!< Read Only */
typedef __I uint8_t vuc8; /*!< Read Only */

typedef enum
{
RESET = 0, SET = !RESET
} FlagStatus, ITStatus;

typedef enum
{
DISABLE = 0, ENABLE = !DISABLE
} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum
{
ERROR = 0, SUCCESS = !ERROR
} ErrorStatus;

/*!< STM32F10x Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSEStartUp_TimeOut   HSE_STARTUP_TIMEOUT
#define HSE_Value            HSE_VALUE
#define HSI_Value            HSI_VALUE
/**
 * @}
 */

/** @addtogroup Peripheral_registers_structures
 * @{
 */

/**
 * @brief Analog to Digital Converter
 */

typedef struct
{
__IO uint32_t SR;__IO uint32_t CR1;__IO uint32_t CR2;__IO uint32_t SMPR1;__IO uint32_t SMPR2;__IO uint32_t JOFR1;__IO uint32_t JOFR2;__IO uint32_t JOFR3;__IO uint32_t JOFR4;__IO uint32_t HTR;__IO uint32_t LTR;__IO uint32_t SQR1;__IO uint32_t SQR2;__IO uint32_t SQR3;__IO uint32_t JSQR;__IO uint32_t JDR1;__IO uint32_t JDR2;__IO uint32_t JDR3;__IO uint32_t JDR4;__IO uint32_t DR;
} ADC_TypeDef;

/**
 * @brief Backup Registers
 */

typedef struct
{
uint32_t RESERVED0;__IO uint16_t DR1;
uint16_t RESERVED1;__IO uint16_t DR2;
uint16_t RESERVED2;__IO uint16_t DR3;
uint16_t RESERVED3;__IO uint16_t DR4;
uint16_t RESERVED4;__IO uint16_t DR5;
uint16_t RESERVED5;__IO uint16_t DR6;
uint16_t RESERVED6;__IO uint16_t DR7;
uint16_t RESERVED7;__IO uint16_t DR8;
uint16_t RESERVED8;__IO uint16_t DR9;
uint16_t RESERVED9;__IO uint16_t DR10;
uint16_t RESERVED10;__IO uint16_t RTCCR;
uint16_t RESERVED11;__IO uint16_t CR;
uint16_t RESERVED12;__IO uint16_t CSR;
uint16_t RESERVED13[5];__IO uint16_t DR11;
uint16_t RESERVED14;__IO uint16_t DR12;
uint16_t RESERVED15;__IO uint16_t DR13;
uint16_t RESERVED16;__IO uint16_t DR14;
uint16_t RESERVED17;__IO uint16_t DR15;
uint16_t RESERVED18;__IO uint16_t DR16;
uint16_t RESERVED19;__IO uint16_t DR17;
uint16_t RESERVED20;__IO uint16_t DR18;
uint16_t RESERVED21;__IO uint16_t DR19;
uint16_t RESERVED22;__IO uint16_t DR20;
uint16_t RESERVED23;__IO uint16_t DR21;
uint16_t RESERVED24;__IO uint16_t DR22;
uint16_t RESERVED25;__IO uint16_t DR23;
uint16_t RESERVED26;__IO uint16_t DR24;
uint16_t RESERVED27;__IO uint16_t DR25;
uint16_t RESERVED28;__IO uint16_t DR26;
uint16_t RESERVED29;__IO uint16_t DR27;
uint16_t RESERVED30;__IO uint16_t DR28;
uint16_t RESERVED31;__IO uint16_t DR29;
uint16_t RESERVED32;__IO uint16_t DR30;
uint16_t RESERVED33;__IO uint16_t DR31;
uint16_t RESERVED34;__IO uint16_t DR32;
uint16_t RESERVED35;__IO uint16_t DR33;
uint16_t RESERVED36;__IO uint16_t DR34;
uint16_t RESERVED37;__IO uint16_t DR35;
uint16_t RESERVED38;__IO uint16_t DR36;
uint16_t RESERVED39;__IO uint16_t DR37;
uint16_t RESERVED40;__IO uint16_t DR38;
uint16_t RESERVED41;__IO uint16_t DR39;
uint16_t RESERVED42;__IO uint16_t DR40;
uint16_t RESERVED43;__IO uint16_t DR41;
uint16_t RESERVED44;__IO uint16_t DR42;
uint16_t RESERVED45;
} BKP_TypeDef;

/**
 * @brief Controller Area Network TxMailBox
 */

typedef struct
{
__IO uint32_t TIR;__IO uint32_t TDTR;__IO uint32_t TDLR;__IO uint32_t TDHR;
} CAN_TxMailBox_TypeDef;

/**
 * @brief Controller Area Network FIFOMailBox
 */

typedef struct
{
__IO uint32_t RIR;__IO uint32_t RDTR;__IO uint32_t RDLR;__IO uint32_t RDHR;
} CAN_FIFOMailBox_TypeDef;

/**
 * @brief Controller Area Network FilterRegister
 */

typedef struct
{
__IO uint32_t FR1;__IO uint32_t FR2;
} CAN_FilterRegister_TypeDef;

/**
 * @brief Controller Area Network
 */

typedef struct
{
__IO uint32_t MCR;__IO uint32_t MSR;__IO uint32_t TSR;__IO uint32_t RF0R;__IO uint32_t RF1R;__IO uint32_t IER;__IO uint32_t ESR;__IO uint32_t BTR;
uint32_t RESERVED0[88];
CAN_TxMailBox_TypeDef sTxMailBox[3];
CAN_FIFOMailBox_TypeDef sFIFOMailBox[2];
uint32_t RESERVED1[12];__IO uint32_t FMR;__IO uint32_t FM1R;
uint32_t RESERVED2;__IO uint32_t FS1R;
uint32_t RESERVED3;__IO uint32_t FFA1R;
uint32_t RESERVED4;__IO uint32_t FA1R;
uint32_t RESERVED5[8];
#ifndef STM32F10X_CL
CAN_FilterRegister_TypeDef sFilterRegister[14];
#else
CAN_FilterRegister_TypeDef sFilterRegister[28];
#endif /* STM32F10X_CL */
} CAN_TypeDef;

/**
 * @brief Consumer Electronics Control (CEC)
 */
typedef struct
{
__IO uint32_t CFGR;__IO uint32_t OAR;__IO uint32_t PRES;__IO uint32_t ESR;__IO uint32_t CSR;__IO uint32_t TXD;__IO uint32_t RXD;
} CEC_TypeDef;

/**
 * @brief CRC calculation unit
 */

typedef struct
{
__IO uint32_t DR;__IO uint8_t IDR;
uint8_t RESERVED0;
uint16_t RESERVED1;__IO uint32_t CR;
} CRC_TypeDef;

/**
 * @brief Digital to Analog Converter
 */

typedef struct
{
__IO uint32_t CR;__IO uint32_t SWTRIGR;__IO uint32_t DHR12R1;__IO uint32_t DHR12L1;__IO uint32_t DHR8R1;__IO uint32_t DHR12R2;__IO uint32_t DHR12L2;__IO uint32_t DHR8R2;__IO uint32_t DHR12RD;__IO uint32_t DHR12LD;__IO uint32_t DHR8RD;__IO uint32_t DOR1;__IO uint32_t DOR2;
#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
__IO uint32_t SR;
#endif
} DAC_TypeDef;

/**
 * @brief Debug MCU
 */

typedef struct
{
__IO uint32_t IDCODE;__IO uint32_t CR;
} DBGMCU_TypeDef;

/**
 * @brief DMA Controller
 */

typedef struct
{
__IO uint32_t CCR;__IO uint32_t CNDTR;__IO uint32_t CPAR;__IO uint32_t CMAR;
} DMA_Channel_TypeDef;

typedef struct
{
__IO uint32_t ISR;__IO uint32_t IFCR;
} DMA_TypeDef;

/**
 * @brief Ethernet MAC
 */

typedef struct
{
__IO uint32_t MACCR;__IO uint32_t MACFFR;__IO uint32_t MACHTHR;__IO uint32_t MACHTLR;__IO uint32_t MACMIIAR;__IO uint32_t MACMIIDR;__IO uint32_t MACFCR;__IO uint32_t MACVLANTR; /*    8 */
uint32_t RESERVED0[2];__IO uint32_t MACRWUFFR; /*   11 */
__IO uint32_t MACPMTCSR;
uint32_t RESERVED1[2];__IO uint32_t MACSR; /*   15 */
__IO uint32_t MACIMR;__IO uint32_t MACA0HR;__IO uint32_t MACA0LR;__IO uint32_t MACA1HR;__IO uint32_t MACA1LR;__IO uint32_t MACA2HR;__IO uint32_t MACA2LR;__IO uint32_t MACA3HR;__IO uint32_t MACA3LR; /*   24 */
uint32_t RESERVED2[40];__IO uint32_t MMCCR; /*   65 */
__IO uint32_t MMCRIR;__IO uint32_t MMCTIR;__IO uint32_t MMCRIMR;__IO uint32_t MMCTIMR; /*   69 */
uint32_t RESERVED3[14];__IO uint32_t MMCTGFSCCR; /*   84 */
__IO uint32_t MMCTGFMSCCR;
uint32_t RESERVED4[5];__IO uint32_t MMCTGFCR;
uint32_t RESERVED5[10];__IO uint32_t MMCRFCECR;__IO uint32_t MMCRFAECR;
uint32_t RESERVED6[10];__IO uint32_t MMCRGUFCR;
uint32_t RESERVED7[334];__IO uint32_t PTPTSCR;__IO uint32_t PTPSSIR;__IO uint32_t PTPTSHR;__IO uint32_t PTPTSLR;__IO uint32_t PTPTSHUR;__IO uint32_t PTPTSLUR;__IO uint32_t PTPTSAR;__IO uint32_t PTPTTHR;__IO uint32_t PTPTTLR;
uint32_t RESERVED8[567];__IO uint32_t DMABMR;__IO uint32_t DMATPDR;__IO uint32_t DMARPDR;__IO uint32_t DMARDLAR;__IO uint32_t DMATDLAR;__IO uint32_t DMASR;__IO uint32_t DMAOMR;__IO uint32_t DMAIER;__IO uint32_t DMAMFBOCR;
uint32_t RESERVED9[9];__IO uint32_t DMACHTDR;__IO uint32_t DMACHRDR;__IO uint32_t DMACHTBAR;__IO uint32_t DMACHRBAR;
} ETH_TypeDef;

/**
 * @brief External Interrupt/Event Controller
 */

typedef struct
{
__IO uint32_t IMR;__IO uint32_t EMR;__IO uint32_t RTSR;__IO uint32_t FTSR;__IO uint32_t SWIER;__IO uint32_t PR;
} EXTI_TypeDef;

/**
 * @brief FLASH Registers
 */

typedef struct
{
__IO uint32_t ACR;__IO uint32_t KEYR;__IO uint32_t OPTKEYR;__IO uint32_t SR;__IO uint32_t CR;__IO uint32_t AR;__IO uint32_t RESERVED;__IO uint32_t OBR;__IO uint32_t WRPR;
#ifdef STM32F10X_XL
uint32_t RESERVED1[8];
__IO uint32_t KEYR2;
uint32_t RESERVED2;
__IO uint32_t SR2;
__IO uint32_t CR2;
__IO uint32_t AR2;
#endif /* STM32F10X_XL */
} FLASH_TypeDef;

/**
 * @brief Option Bytes Registers
 */

typedef struct
{
__IO uint16_t RDP;__IO uint16_t USER;__IO uint16_t Data0;__IO uint16_t Data1;__IO uint16_t WRP0;__IO uint16_t WRP1;__IO uint16_t WRP2;__IO uint16_t WRP3;
} OB_TypeDef;

/**
 * @brief Flexible Static Memory Controller
 */

typedef struct
{
__IO uint32_t BTCR[8];
} FSMC_Bank1_TypeDef;

/**
 * @brief Flexible Static Memory Controller Bank1E
 */

typedef struct
{
__IO uint32_t BWTR[7];
} FSMC_Bank1E_TypeDef;

/**
 * @brief Flexible Static Memory Controller Bank2
 */

typedef struct
{
__IO uint32_t PCR2;__IO uint32_t SR2;__IO uint32_t PMEM2;__IO uint32_t PATT2;
uint32_t RESERVED0;__IO uint32_t ECCR2;
} FSMC_Bank2_TypeDef;

/**
 * @brief Flexible Static Memory Controller Bank3
 */

typedef struct
{
__IO uint32_t PCR3;__IO uint32_t SR3;__IO uint32_t PMEM3;__IO uint32_t PATT3;
uint32_t RESERVED0;__IO uint32_t ECCR3;
} FSMC_Bank3_TypeDef;

/**
 * @brief Flexible Static Memory Controller Bank4
 */

typedef struct
{
__IO uint32_t PCR4;__IO uint32_t SR4;__IO uint32_t PMEM4;__IO uint32_t PATT4;__IO uint32_t PIO4;
} FSMC_Bank4_TypeDef;

/**
 * @brief General Purpose I/O
 */

typedef struct
{
__IO uint32_t CRL;__IO uint32_t CRH;__IO uint32_t IDR;__IO uint32_t ODR;__IO uint32_t BSRR;__IO uint32_t BRR;__IO uint32_t LCKR;
} GPIO_TypeDef;

/**
 * @brief Alternate Function I/O
 */

typedef struct
{
__IO uint32_t EVCR;__IO uint32_t MAPR;__IO uint32_t EXTICR[4];
uint32_t RESERVED0;__IO uint32_t MAPR2;
} AFIO_TypeDef;
/**
 * @brief Inter Integrated Circuit Interface
 */

typedef struct
{
__IO uint16_t CR1;
uint16_t RESERVED0;__IO uint16_t CR2;
uint16_t RESERVED1;__IO uint16_t OAR1;
uint16_t RESERVED2;__IO uint16_t OAR2;
uint16_t RESERVED3;__IO uint16_t DR;
uint16_t RESERVED4;__IO uint16_t SR1;
uint16_t RESERVED5;__IO uint16_t SR2;
uint16_t RESERVED6;__IO uint16_t CCR;
uint16_t RESERVED7;__IO uint16_t TRISE;
uint16_t RESERVED8;
} I2C_TypeDef;

/**
 * @brief Independent WATCHDOG
 */

typedef struct
{
__IO uint32_t KR;__IO uint32_t PR;__IO uint32_t RLR;__IO uint32_t SR;
} IWDG_TypeDef;

/**
 * @brief Power Control
 */

typedef struct
{
__IO uint32_t CR;__IO uint32_t CSR;
} PWR_TypeDef;

/**
 * @brief Reset and Clock Control
 */

typedef struct
{
__IO uint32_t CR;__IO uint32_t CFGR;__IO uint32_t CIR;__IO uint32_t APB2RSTR;__IO uint32_t APB1RSTR;__IO uint32_t AHBENR;__IO uint32_t APB2ENR;__IO uint32_t APB1ENR;__IO uint32_t BDCR;__IO uint32_t CSR;

#ifdef STM32F10X_CL
__IO uint32_t AHBRSTR;
__IO uint32_t CFGR2;
#endif /* STM32F10X_CL */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
uint32_t RESERVED0;
__IO uint32_t CFGR2;
#endif /* STM32F10X_LD_VL || STM32F10X_MD_VL || STM32F10X_HD_VL */
} RCC_TypeDef;

/**
 * @brief Real-Time Clock
 */

typedef struct
{
__IO uint16_t CRH;
uint16_t RESERVED0;__IO uint16_t CRL;
uint16_t RESERVED1;__IO uint16_t PRLH;
uint16_t RESERVED2;__IO uint16_t PRLL;
uint16_t RESERVED3;__IO uint16_t DIVH;
uint16_t RESERVED4;__IO uint16_t DIVL;
uint16_t RESERVED5;__IO uint16_t CNTH;
uint16_t RESERVED6;__IO uint16_t CNTL;
uint16_t RESERVED7;__IO uint16_t ALRH;
uint16_t RESERVED8;__IO uint16_t ALRL;
uint16_t RESERVED9;
} RTC_TypeDef;

/**
 * @brief SD host Interface
 */

typedef struct
{
__IO uint32_t POWER;__IO uint32_t CLKCR;__IO uint32_t ARG;__IO uint32_t CMD;__I uint32_t RESPCMD;__I uint32_t RESP1;__I uint32_t RESP2;__I uint32_t RESP3;__I uint32_t RESP4;__IO uint32_t DTIMER;__IO uint32_t DLEN;__IO uint32_t DCTRL;__I uint32_t DCOUNT;__I uint32_t STA;__IO uint32_t ICR;__IO uint32_t MASK;
uint32_t RESERVED0[2];__I uint32_t FIFOCNT;
uint32_t RESERVED1[13];__IO uint32_t FIFO;
} SDIO_TypeDef;

/**
 * @brief Serial Peripheral Interface
 */

typedef struct
{
__IO uint16_t CR1;
uint16_t RESERVED0;__IO uint16_t CR2;
uint16_t RESERVED1;__IO uint16_t SR;
uint16_t RESERVED2;__IO uint16_t DR;
uint16_t RESERVED3;__IO uint16_t CRCPR;
uint16_t RESERVED4;__IO uint16_t RXCRCR;
uint16_t RESERVED5;__IO uint16_t TXCRCR;
uint16_t RESERVED6;__IO uint16_t I2SCFGR;
uint16_t RESERVED7;__IO uint16_t I2SPR;
uint16_t RESERVED8;
} SPI_TypeDef;

/**
 * @brief TIM
 */

typedef struct
{
__IO uint16_t CR1;
uint16_t RESERVED0;__IO uint16_t CR2;
uint16_t RESERVED1;__IO uint16_t SMCR;
uint16_t RESERVED2;__IO uint16_t DIER;
uint16_t RESERVED3;__IO uint16_t SR;
uint16_t RESERVED4;__IO uint16_t EGR;
uint16_t RESERVED5;__IO uint16_t CCMR1;
uint16_t RESERVED6;__IO uint16_t CCMR2;
uint16_t RESERVED7;__IO uint16_t CCER;
uint16_t RESERVED8;__IO uint16_t CNT;
uint16_t RESERVED9;__IO uint16_t PSC;
uint16_t RESERVED10;__IO uint16_t ARR;
uint16_t RESERVED11;__IO uint16_t RCR;
uint16_t RESERVED12;__IO uint16_t CCR1;
uint16_t RESERVED13;__IO uint16_t CCR2;
uint16_t RESERVED14;__IO uint16_t CCR3;
uint16_t RESERVED15;__IO uint16_t CCR4;
uint16_t RESERVED16;__IO uint16_t BDTR;
uint16_t RESERVED17;__IO uint16_t DCR;
uint16_t RESERVED18;__IO uint16_t DMAR;
uint16_t RESERVED19;
} TIM_TypeDef;

/**
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */

typedef struct
{
__IO uint16_t SR;
uint16_t RESERVED0;__IO uint16_t DR;
uint16_t RESERVED1;__IO uint16_t BRR;
uint16_t RESERVED2;__IO uint16_t CR1;
uint16_t RESERVED3;__IO uint16_t CR2;
uint16_t RESERVED4;__IO uint16_t CR3;
uint16_t RESERVED5;__IO uint16_t GTPR;
uint16_t RESERVED6;
} USART_TypeDef;

/**
 * @brief Window WATCHDOG
 */

typedef struct
{
__IO uint32_t CR;__IO uint32_t CFR;__IO uint32_t SR;
} WWDG_TypeDef;

/**
 * @}
 */

/** @addtogroup Peripheral_memory_map
 * @{
 */

